### Bootstrap
Reservando valores e criando dataframes

In [66]:
!pip install pandas -q

[notice] A new release of pip available: 22.3.1 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [67]:
import pandas as pd

In [68]:
carros = {
	'Placa': ['45-77-AA', '21-05-EN', '81-99-HT'],
	'Marca': ['FIAT', 'OPEL', 'Citroen'],
	'Modelo': ['Uno', 'Astra', 'Xantia'],
    'Cor': ['Cinzento', 'Cinzento', 'Azul Metalizado'],
	'Cilindradas': [1100, 1400, 1640]
}

pessoas = {
    'RG': ['12345', '23456', '34567'],
    'Nome': ['Marilia', 'Cidalia', 'Celia'],
    'Endereco': ['Rua X', 'Rua Y', 'Rua Z'],
    'Placa': ['81-99-HT', '45-77-AA', '81-99-HT']
}

df_carro = pd.DataFrame(data=carros, columns=carros.keys())
df_pessoa = pd.DataFrame(data=pessoas, columns=pessoas.keys())

### Queries
Fazendo seleções, transformações e agrupamentos dos dados

Selecionar tudo da tabela de carros

In [69]:
df_carro

      Placa    Marca  Modelo              Cor  Cilindradas
0  45-77-AA     FIAT     Uno         Cinzento         1100
1  21-05-EN     OPEL   Astra         Cinzento         1400
2  81-99-HT  Citroen  Xantia  Azul Metalizado         1640

Selecioanr tudo da tabela pessoas

In [70]:
df_pessoa

      RG     Nome Endereco     Placa
0  12345  Marilia    Rua X  81-99-HT
1  23456  Cidalia    Rua Y  45-77-AA
2  34567    Celia    Rua Z  81-99-HT

Seleciona as colunas Nome e Placa da tabela Pessoa

In [71]:
df_pessoa[['Nome', 'Placa']]

      Nome     Placa
0  Marilia  81-99-HT
1  Cidalia  45-77-AA
2    Celia  81-99-HT

Filtrar apenas as linhas que tem cilindrada menor que 1500

In [72]:
df_carro[['Marca', 'Modelo', 'Cilindradas']].query('Cilindradas < 1500')

  Marca Modelo  Cilindradas
0  FIAT    Uno         1100
1  OPEL  Astra         1400

Filtrar apenas as linhas que começam com CINZ...

In [73]:
df_carro[df_carro['Cor'].str.startswith('Cinz')]

      Placa Marca Modelo       Cor  Cilindradas
0  45-77-AA  FIAT    Uno  Cinzento         1100
1  21-05-EN  OPEL  Astra  Cinzento         1400

Juntar a tabela Carro com a tabela Pessoa obtendo Nome, Placa, Marca e Modelo

In [74]:
df_carro_pessoa = df_carro.merge(df_pessoa, on='Placa', how='inner')
df_carro_pessoa[['Nome', 'Placa', 'Modelo']]

      Nome     Placa  Modelo
0  Cidalia  45-77-AA     Uno
1  Marilia  81-99-HT  Xantia
2    Celia  81-99-HT  Xantia

Ordena pelo critério Nome

In [75]:
df_carro_pessoa[['Nome', 'Placa', 'Modelo']].sort_values(by=['Nome'])

      Nome     Placa  Modelo
2    Celia  81-99-HT  Xantia
0  Cidalia  45-77-AA     Uno
1  Marilia  81-99-HT  Xantia

As ordenações podem ter mais de um critério podendo ser Ascendente (ASC) ou Descendente (DESC)

In [76]:
df_carro_pessoa[['Nome', 'Marca', 'Placa', 'Modelo']].sort_values(by=['Marca', 'Nome'], ascending=[False, True])

      Nome    Marca     Placa  Modelo
0  Cidalia     FIAT  45-77-AA     Uno
2    Celia  Citroen  81-99-HT  Xantia
1  Marilia  Citroen  81-99-HT  Xantia


Usando a função COUNT para saber a quantidade de linhas

In [77]:
contador_maior_que_1200 = df_carro.query('Cilindradas > 1200').shape[0]
print('Contador: ', contador_maior_que_1200)

Contador:  2

Testando funções de resumo

In [78]:
df_carro.describe()

       Cilindradas
count     3.000000
mean   1380.000000
std     270.554985
min    1100.000000
25%    1250.000000
50%    1400.000000
75%    1520.000000
max    1640.000000

Transformando uma coluna em seu dobro

In [79]:
df_carro[['Marca', 'Modelo', 'Cilindradas']].assign(Preco=lambda item: item.Cilindradas * 2)

     Marca  Modelo  Cilindradas  Preco
0     FIAT     Uno         1100   2200
1     OPEL   Astra         1400   2800
2  Citroen  Xantia         1640   3280

Aninhamento de comando Pandas

In [80]:
df_carro[~df_carro.Placa.isin(df_pessoa.Placa)]

      Placa Marca Modelo       Cor  Cilindradas
1  21-05-EN  OPEL  Astra  Cinzento         1400

Agrupando e contando os carros por cores

In [81]:
df_carro.groupby(by='Cor').count()

                 Placa  Marca  Modelo  Cilindradas
Cor
Azul Metalizado      1      1       1            1
Cinzento             2      2       2            2

### Update
Adionando colunas e alterando valores

Devido a um processo judicial o carro da placa 45-77-AA será modificado para placa 21-05-EN

In [82]:
df_pessoa.Placa.replace(to_replace='45-77-AA', value='21-05-EN', inplace=True)
df_pessoa

      RG     Nome Endereco     Placa
0  12345  Marilia    Rua X  81-99-HT
1  23456  Cidalia    Rua Y  21-05-EN
2  34567    Celia    Rua Z  81-99-HT

Adicionando a coluna TM na tabela Pessoa

In [83]:
df_pessoa['TM'] = ''
df_pessoa

      RG     Nome Endereco     Placa TM
0  12345  Marilia    Rua X  81-99-HT
1  23456  Cidalia    Rua Y  21-05-EN
2  34567    Celia    Rua Z  81-99-HT


Vamos adicionar alguns valores na coluna TM 

Vamos colocar um número de celular pra todas as pessoas que tem a letra C no nome
```
UPDATE Pessoa
SET TM='961234567'
WHERE Nome LIKE '%C%';
```

Esse foi o único que não consegui

In [84]:
df_pessoa[df_pessoa.Nome.str.contains('C')]

      RG     Nome Endereco     Placa TM
1  23456  Cidalia    Rua Y  21-05-EN
2  34567    Celia    Rua Z  81-99-HT

### Save

In [85]:
df_carro.to_csv('../data/carros.csv')
df_pessoa.to_csv('../data/pessoas.csv')

### Delete 
Deletando linhas desnecessárias e finalizando o projeto

Já que o carro da marca FIAT não é utilizado por ninguém na empresa vamos apagar o seu registro

In [86]:
df_carro.drop(df_carro.query('Marca == "FIAT"').index, inplace=True)
df_carro

      Placa    Marca  Modelo              Cor  Cilindradas
1  21-05-EN     OPEL   Astra         Cinzento         1400
2  81-99-HT  Citroen  Xantia  Azul Metalizado         1640

Cansei de trabalhar com essas tabelas

Vamos apagar tudo

In [87]:
df_carro.drop(df_carro.index, inplace=True)
df_carro

Empty DataFrame
Columns: [Placa, Marca, Modelo, Cor, Cilindradas]
Index: []

In [88]:
df_pessoa.drop(df_pessoa.index, inplace=True)
df_pessoa

Empty DataFrame
Columns: [RG, Nome, Endereco, Placa, TM]
Index: []

In [89]:
df_carro = None
df_pessoa = None
df_carro, df_pessoa

(None, None)